---
kind: method
id: M:Autodesk.Revit.DB.BoundarySegment.Dispose
source: html/12c14b5a-18f2-020b-1924-3e24712a5083.htm
---
# Autodesk.Revit.DB.BoundarySegment.Dispose Method

Releases all resources used by the BoundarySegment

## Syntax (C#)
```csharp
public void Dispose()
```